{
    "format": "layers-model",
    "generatedBy": "tfjs-converter",
    "convertedBy": "1.15.0",
    "modelTopology": {
      "class_name": "Sequential",
      "config": {
        "name": "sequential",
        "layers": [
          {
            "class_name": "Dense",
            "config": {
              "name": "dense",
              "trainable": true,
              "batch_input_shape": [null, 10],
              "dtype": "float32",
              "units": 8,
              "activation": "relu"
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_1",
              "trainable": true,
              "dtype": "float32",
              "units": 3,
              "activation": "softmax"
            }
          }
        ]
      },
      "keras_version": "2.15.0",
      "backend": "tensorflow"
    },
    "weightsManifest": [
      {
        "paths": ["group1-shard1of1.bin"],
        "weights": [
          {
            "name": "dense/kernel",
            "shape": [10, 8],
            "dtype": "float32"
          },
          {
            "name": "dense/bias",
            "shape": [8],
            "dtype": "float32"
          },
          {
            "name": "dense_1/kernel",
            "shape": [8, 3],
            "dtype": "float32"
          },
          {
            "name": "dense_1/bias",
            "shape": [3],
            "dtype": "float32"
          }
        ]
      }
    ]
  }