{
    "format": "layers-model",
    "generatedBy": "tfjs-converter",
    "convertedBy": "1.15.0",
    "modelTopology": {
      "class_name": "Sequential",
      "config": {
        "name": "sequential",
        "layers": [
          {
            "class_name": "Dense",
            "config": {
              "name": "dense",
              "trainable": true,
              "dtype": "float32",
              "units": 1,
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          }
        ]
      },
      "keras_version": "2.15.0",
      "backend": "tensorflow"
    },
    "weightsManifest": [
      {
        "paths": ["group1-shard1of1.bin"],
        "weights": [
          {
            "name": "dense/kernel",
            "shape": [3, 1],
            "dtype": "float32"
          },
          {
            "name": "dense/bias",
            "shape": [1],
            "dtype": "float32"
          }
        ]
      }
    ]
  }